Revit 2024 API
RebarUpdateCurvesData.SetCycleCounter Method
 Sets the cycle counter to a specific value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void SetCycleCounter(
	int cycleCounter
)
Visual Basic
Public Sub SetCycleCounter ( _
	cycleCounter As Integer _
)
Visual C++
public:
void SetCycleCounter(
	int cycleCounter
)
Parameters
cycleCounter
Type: System.Int32
Remarks
The actual value is set into the rebar after the curves computation.
This function can be called to reset the counter to zero or to another value.
The cycle counter value is changed when the free form Rebar element is selected and the user press Space key -or- by through [!:Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter] property. -or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for cycleCounter is negative.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace